TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_flashctl.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_flashctl.h
 *  @brief      Flash Controller Driver Library
 *  @defgroup   FLASHCTL Flash Controller (FLASHCTL)
 *
 *  @anchor ti_dl_dl_flashctl_Overview
 *  # Overview
 *
 *  The Flash Controller Driver Library allows full configuration of
 *  the MSPM33 Non-Volatile memory system.
 *  The non-volatile memory (NVM) system provides nonvolatile flash memory for
 *  storing executable code and data.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup FLASHCTL
 * @{
 */
#ifndef ti_dl_dl_flashctl__include
#define ti_dl_dl_flashctl__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/m33/dl_factoryregion.h>
#include <ti/driverlib/m33/dl_sysctl.h>

#ifdef __cplusplus
extern "C" {
#endif

#if (FLASHCTL_SYS_DATAWIDTH == 128)
/*!
 * @brief Device has 128 bit flash word width
 */
#define DEVICE_HAS_FLASH_128_BIT_WORD
#endif

#if (FLASHCTL_SYS_WEPROTAWIDTH == 0)
/*!
 *  @brief Device does not have CMDWEPROTA
 */
#define DEVICE_HAS_NO_CMDWEPROTA
#endif

/* clang-format off */

/*!
 * @brief Address for Bank 0 Main
 */
#define FLASHCTL_BANK0_MAIN_ADDRESS                                 (0x00000000U)

/*!
 * @brief Address for Bank 1 Main
 */
#define FLASHCTL_BANK1_MAIN_ADDRESS                                 (0x00080000U)

/*!
 * @brief Address for Bank 2 Main
 */
#define FLASHCTL_BANK2_MAIN_ADDRESS                                 (0x80000000U)

/*!
 * @brief Address for Bank 0 Nonmain
 */
#define FLASHCTL_BANK0_NONMAIN_ADDRESS                              (0x80100000U)

/*!
 * @brief Address for Bank 1 Nonmain
 */
#define FLASHCTL_BANK1_NONMAIN_ADDRESS                              (0x80102000U)

/*!
 * @brief Address for Bank 2 Nonmain
 */
#define FLASHCTL_BANK2_NONMAIN_ADDRESS                              (0x8010C000U)

/*!
 * @brief Address for Bank 0 Trim
 */
#define FLASHCTL_BANK0_TRIM_ADDRESS                                 (0x80110000U)

/*!
 * @brief Address for Bank 1 Trim
 */
#define FLASHCTL_BANK1_TRIM_ADDRESS                                 (0x80111000U)

/*!
 * @brief Address for Bank 0 Engr
 */
#define FLASHCTL_BANK0_ENGR_ADDRESS                                 (0x80118000U)

/*!
 * @brief Address for Bank 1 Engr
 */
#define FLASHCTL_BANK1_ENGR_ADDRESS                                 (0x80119000U)

/*!
 * @brief Address for Bank 2 Engr
 */
#define FLASHCTL_BANK2_ENGR_ADDRESS                                 (0x80120000U)

/*!
 * @brief Address for DATA memory region
 */
#define FLASHCTL_DATA_ADDRESS                                       (0x80000000U)

/*!
 * @brief Enable programming 8 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_8_WITHOUT_ECC                           (0x00000001U)

/*!
 * @brief Enable programming 16 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_16_WITHOUT_ECC                          (0x00000003U)

/*!
 * @brief Enable programming 32 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_32_WITHOUT_ECC                          (0x0000000FU)

/*!
 * @brief Enable programming 64 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_64_WITHOUT_ECC                          (0x000000FFU)

/*!
 * @brief Enable programming 96 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_96_WITHOUT_ECC                          (0x00000FFFU)

/*!
 * @brief Enable programming 128 bits without ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_128_WITHOUT_ECC                         (0x0000FFFFU)

/*!
 * @brief Enable programming 8 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_8_WITH_ECC                              (0x00010001U)

/*!
 * @brief Enable programming 16 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_16_WITH_ECC                             (0x00010003U)

/*!
 * @brief Enable programming 32 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_32_WITH_ECC                             (0x0001000FU)

/*!
 * @brief Enable programming 64 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_64_WITH_ECC                             (0x000100FFU)

/*!
 * @brief Enable programming 96 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_96_WITH_ECC                             (0x00030FFFU)

/*!
 * @brief Enable programming 128 bits with ECC enabled
 */
#define DL_FLASHCTL_PROGRAM_128_WITH_ECC                            (0x0003FFFFU)

/*!
 * @brief Enable programming 8 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_8_WITHOUT_ECC                       (0x00000001U)

/*!
 * @brief Enable programming 16 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_16_WITHOUT_ECC                      (0x00000003U)

/*!
 * @brief Enable programming 32 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_32_WITHOUT_ECC                      (0x0000000FU)

/*!
 * @brief Enable programming 64 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_64_WITHOUT_ECC                      (0x000000FFU)

/*!
 * @brief Enable programming 96 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_96_WITHOUT_ECC                      (0x00000FFFU)

/*!
 * @brief Enable programming 128 bits without ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_128_WITHOUT_ECC                     (0x0000FFFFU)

/*!
 * @brief Enable programming 8 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_8_WITH_ECC                          (0x00010001U)

/*!
 * @brief Enable programming 16 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_16_WITH_ECC                         (0x00010003U)

/*!
 * @brief Enable programming 32 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_32_WITH_ECC                         (0x0001000FU)

/*!
 * @brief Enable programming 64 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_64_WITH_ECC                         (0x000100FFU)

/*!
 * @brief Enable programming 96 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_96_WITH_ECC                         (0x00030FFFU)

/*!
 * @brief Enable programming 128 bits with ECC enabled
 */
#define DL_FLASHCTL_READ_VERIFY_128_WITH_ECC                        (0x0003FFFFU)

