TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_flashctl.h
/**
 *  @brief      Programs provided data with user provided ECC code, and
 *              executes command from RAM
 *
 *  Blocking function that programs a set of data, along with the 16 ECC bits
 *  which correspond to the data at the given address. This API assumes that
 *  hardware generation of the ECC code HAS been disabled, and so the user
 *  must provide the ECC code to program.
 *
 *  The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl   Pointer to the register overlay for the peripheral
 *  @param[in]  address    Destination memory address to program data. The
 *                         address must be flash word (128-bit) aligned i.e.
 *                         aligned to a b0000 boundary.
 *  @param[in]  dataSize      The number of 32-bit words to program. Value
 *                            should be divisible by 4, to ensure data is
 *                            programmed 128-bits at a time.
 *  @param[in]  data          Pointer to the data source to program into flash
 *  @param[in]  eccCode       Pointer to ECC code to program corresponding to data
 *  @param[in]  regionSelect  The region of memory to erase. One of
 *                            @ref DL_FLASHCTL_REGION_SELECT
 *
 *  @return     Whether or not the program succeeded
 *
 *  @retval     false   Program didn't succeed, or invalid dataSize
 *  @retval     true    Program was successful
 *
 *  @pre         User must call @ref DL_FlashCTL_enableOverrideHardwareGeneratedECC
 *               to disable hardware generation of the ECC code, so the ECC code
 *               can be manually provided for programming. This override setting
 *               will persist through multiple programs, until
 *               @ref DL_FlashCTL_disableOverrideHardwareGeneratedECC is called
 *
 *  NOTE: After completion of a program operation, the flash controller will
 *  configure all memory to a protected state.
 *  NOTE: After completion of a program operation, the flash controller will
 *  disable programming of the ECC code (regardless of whether ECC code is
 *  hardware generated or manually provided).
 */
DL_FLASHCTL_COMMAND_STATUS
DL_FlashCTL_programMemoryBlockingFromRAM128WithECCManual(
    FLASHCTL_Regs *flashctl, uint32_t address, uint32_t *data,
    uint8_t *eccCode, uint32_t dataSize,
    DL_FLASHCTL_REGION_SELECT regionSelect);

/**
 *  @brief      Programs provided data to unprotected memory at a given address
 *
 *  Blocking function that programs a set of data. Data will be programmed as
 *  flash words (128-bits), 96-bits, 64-bits. If dataSize is an odd number, then the last word
 *  will be programmed as 32-bit data.
 *
 *  @param[in]  flashctl   Pointer to the register overlay for the peripheral
 *  @param[in]  address    Destination memory address to program data. The
 *                         address must be flash word (128-bit) aligned i.e.
 *                         aligned to a b0000 boundary.
 *  @param[in]  dataSize      The number of 32-bit words to program
 *  @param[in]  data          Pointer to the data source to program into flash
 *  @param[in]  regionSelect  The region of memory to erase. One of
 *                            @ref DL_FLASHCTL_REGION_SELECT
 *
 *  @return     Whether or not the program succeeded
 *
 *  @retval     false   Program didn't succeed
 *  @retval     true    Program was successful
 *
 *  @pre         Before programming memory, the user must unprotect the region
 *               of memory to program. Refer to @ref DL_FlashCTL_unprotectSector
 *  @post        This API just starts the program process. Check the result of it
 *               using an interrupt or the @ref DL_FlashCTL_waitForCmdDone API
 *
 *  NOTE: After completion of a program operation, the flash controller will
 *  configure all memory to a protected state.
 *  NOTE: This API does not enable programming the ECC code.
 */
bool DL_FlashCTL_programMemoryBlocking(FLASHCTL_Regs *flashctl,
    uint32_t address, uint32_t *data, uint32_t dataSize,
    DL_FLASHCTL_REGION_SELECT regionSelect);

/**
 *  @brief      Programs provided data to unprotected memory at a given
 *              address, and executes command from RAM
 *
 *  Blocking function that programs a set of data. Data will be programmed as
 *  flash words (128-bits), 96-bits, 64-bits. If dataSize is an odd number, then the last word
 *  will be programmed as 32-bit data.
 *
 *  The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl   Pointer to the register overlay for the peripheral
 *  @param[in]  address    Destination memory address to program data. The
 *                         address must be flash word (128-bit) aligned i.e.
 *                         aligned to a b0000 boundary.
 *  @param[in]  dataSize      The number of 32-bit words to program
 *  @param[in]  data          Pointer to the data source to program into flash
 *  @param[in]  regionSelect  The region of memory to erase. One of
 *                            @ref DL_FLASHCTL_REGION_SELECT
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 *  @pre         Before programming memory, the user must unprotect the region
 *               of memory to program. Refer to @ref DL_FlashCTL_unprotectSector
 *
 *  NOTE: After completion of a program operation, the flash controller will
 *  configure all memory to a protected state.
 *  NOTE: This API does not enable programming the ECC code.
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_programMemoryFromRAM(
    FLASHCTL_Regs *flashctl, uint32_t address, uint32_t *data,
    uint32_t dataSize, DL_FLASHCTL_REGION_SELECT regionSelect);

/**
 *  @brief      Unprotects all main memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_unprotectMainMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Unprotects all data memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_unprotectDataMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Protects all main memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_protectMainMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Unprotects all non-main memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_unprotectNonMainMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Protects all non-main memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_protectNonMainMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Unprotects all user memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_unprotectAllMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Protects all user memory from erase/program
 *
 *  @param[in]  flashctl  Pointer to the register overlay for the peripheral
 */
void DL_FlashCTL_protectAllMemory(FLASHCTL_Regs *flashctl);

/**
 *  @brief      Sets a given sector to unprotected from erase/program
 *
 *  @param[in]  flashctl   Pointer to the register overlay for the peripheral
 *  @param[in]  addr          Address of sector to unprotect
 *  @param[in]  regionSelect  The region of memory to unprotect. One of
 *                            @ref DL_FLASHCTL_REGION_SELECT
 */
void DL_FlashCTL_unprotectSector(FLASHCTL_Regs *flashctl, uint32_t addr,
    DL_FLASHCTL_REGION_SELECT regionSelect);

/**
 *  @brief      Sets a given sector to protected from erase/program
 *
 *  @param[in]  flashctl   Pointer to the register overlay for the peripheral
 *  @param[in]  addr          Address of sector to protect
 *  @param[in]  regionSelect  The region of memory to protect. One of
 *                            @ref DL_FLASHCTL_REGION_SELECT
 */
void DL_FlashCTL_protectSector(FLASHCTL_Regs *flashctl, uint32_t addr,
    DL_FLASHCTL_REGION_SELECT regionSelect);

/**
 *  @brief      Verifies 8-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify8(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint8_t *data);

/**
 *  @brief      Verifies 8-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM8(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint8_t *data);

/**
 *  @brief      Verifies 16-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify16(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint16_t *data);

/**
 *  @brief      Verifies 16-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM16(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint16_t *data);

/**
 *  @brief      Verifies 32-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify32(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 32-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM32(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 64-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify64(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 64-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM64(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 96-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify96(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 96-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM96(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 128-bit data in specified address
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 */
void DL_FlashCTL_readVerify128(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

/**
 *  @brief      Verifies 128-bit data in specified address, and executes command
 *              from RAM
 *
 * The READVERIFY command may be used to read a flash location and compare it
 * to data to be verified.
 *
 * The command is executed from RAM, and blocks until the command is finished.
 *
 *  @param[in]  flashctl    Pointer to the register overlay for the peripheral
 *  @param[in]  address     Memory address of flash to verify.
 *  @param[in]  data        Pointer to the data source to verify
 *
 *  @return     Whether or not the command was successful.
 *              One of @ref DL_FLASHCTL_COMMAND_STATUS
 *
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_FAILED   if command didn't succeed
 *  @retval     DL_FLASHCTL_COMMAND_STATUS_PASSED   if command was successful
 *
 */
DL_FLASHCTL_COMMAND_STATUS DL_FlashCTL_readVerifyFromRAM128(
    FLASHCTL_Regs *flashctl, uint32_t address, const uint32_t *data);

